#pragma once
// сообщения, выводимые в консоль при сборке проекта
char LEXERROR[] = "Лексический анализ:        Обнаружена ошибка.";
char SYNTERROR[] = "Синтаксический анализ:     Обнаружена ошибка.";
char SEMERROR[] = "Семантический анализ:      Обнаружена ошибка.";
char POLISHERROR[] = "Преобразование выражений:  Обнаружена ошибка.";
char LEXGOOD[] = "Лексический анализ:        Завершен успешно.";
char SYNTGOOD[] = "Синтаксический анализ:     Завершен успешно.";
char SEMGOOD[] = "Семантический анализ:      Завершен успешно.";
char POLISHGOOD[] = "Преобразование выражений:  Завершен успешно.";
char MESSAGE[] = "\n====================  КОНЕЧНЫЕ ТАБЛИЦЫ ЛЕКСЕМ И ИДЕНТИФИКАТОРОВ  ===================";
char STOP[] = "\n      Выполнение программы остановлено.";
char ALLGOOD[] = "Программа успешно завершена!";